Fs=512;
wp=[0.5/Fs,50/Fs];                %设置通带数字角频率
ws=[0.25/Fs,55/Fs];                %设置阻带数字角频率
Fs=512;
wp=[0.5/Fs,50/Fs];                %设置通带数字角频率
ws=[0.25/Fs,55/Fs];                %设置阻带数字角频率
[N,Wn]=buttord(wp,ws,Rp,Rs,'s');        %求巴特沃斯滤波器阶数N和截止频率Wn
%无论是高通、带通和带阻滤波器，在设计中最终都等效于一个截止频率为Wn的低通滤波器(我现在也不是很理解为啥是这样，毕竟我也是刚接触滤波器)
fprintf('巴特沃斯滤波器 N= %4d\n',N);    %显示滤波器阶数
[bb,ab]=butter(N,Wn,'s');               %求巴特沃斯滤波器系数，即求传输函数的分子和分母的系数向量
%b2=filter(bb,ab,b);                     %filter既能进行IIR滤波又能进行FIR滤波
W=-600:0.1:600;                             %设置模拟频率
[Hb,wb]=freqz(bb,ab,W,Fs);                  %求巴特沃斯滤波器频率响应
plot(wb,20*log10(abs(Hb)),'b');             %作图
xlabel('Hz');
ylabel('幅值/dB');
